import { Message } from "@shared/schema";

export const sampleMessageData: Message[] = [
    {
        "id": 1666,
        "userId": 27,
        "content": "うごき統計について、教えて。",
        "isBot": false,
        "timestamp": new Date("2025-06-13T05:41:58.425Z"),
        "sessionId": "aayush.yadav",
        "category": "SELF"
    },
    {
        "id": 1667,
        "userId": 27,
        "content": "うごき統計は、基地局から取得した位置情報を活用することで、24時間365日、日本全国の人々の「移動」と「滞在」を詳細に把握できる統計データサービスです。特に、全国うごき統計は、日本国内の人口移動の傾向を分析することが可能で、コロナ禍以前のデータも含めて、2019年10月以降の統計が利用できます。人口が少ない地域でも統計的な補正を行い、高い精度での分析が可能です。\n\nなお、全国うごき統計と全国来た来ぬ統計は日本人のみを対象としており、外国人の動きを分析したい場合には、全国インバウンド統計を活用することが推奨されています。このサービスはソフトバンク株式会社によって提供されており、マーケティングや交通計画、都市計画の分野で活用されています。\n\n詳細な情報や個別の活用方法についての相談は、地域や分野の担当者にご連絡いただくことをお勧めします。具体的な担当者については、【地方別担当】や【中央省庁の分野担当】から確認してください。\n\n### 社内文書情報:\n\n📄[人流３兄弟 部内ミニ講座②基礎編.txt](https://drive.google.com/file/d/1-Psth5LI_poOmaOdhxe3mji2oCJs6akq/view?usp=drivesdk)\n\n売れているかという事は我々も把握していますが、どの様に何に使用したかという細かいところまでは落とし込めていないので参考させて頂き出来たら皆さんに展開します。\r\nちなみに今、全国うごき統計を含め人流3兄弟がどこに売れたかという地方と分野別のマトリクス表を作っていて、どこに売れている、どこの業界分野に売れているのか、逆にどこの業界分野に攻めないといけないのか、という表を作っているので、恐らく来週に会で共有できると思います。\r\n\r\nFAQ（全国うごき統計）\r\nQ.過去への遡りはどこまで可能ですか\r\nA.2019年10月以降です。全国うごき統計に関しては、コロナ禍前の統計も取れるので、あまりコロナ禍と言われることはないと思いますがコロナ禍前後の統計も取れるとも言えると思います。\r\n\r\nQ.基地局なので、人口が少ない地域でも分析できるのですか\r\nA.基地局なので圧倒的なサンプル数があることと、我々は統計上の補正をかけて拡大推計をしているので基本的には全国のどこでも精度の高い分析ができます。\n---\n- **全国うごき統計**と**全国来た来ぬ統計**は、日本人のみを分析対象としている。\n- 外国人（インバウンド）は、これらの統計では分析できない。\n- 外国人を分析したい場合は、**全国インバウンド統計**を活用するべき。\n\n✍️ データ作成者: kengo.imai\n---\n📄[【サービス概要】全国うごき統計_サービス内容のご紹介_2212-1.pdf](https://drive.google.com/file/d/18KxcDVkooZJv6sW37wA3IZ0i9_RCTKRV/view?usp=drivesdk)\n\n全国うごき統計とは、基地局から取得した位置情報を活用し、24時間365日・全国1.2億人の「移動」と「滞在」を把握できる統計データサービスです。このサービスはソフトバンク株式会社が提供しています。\n---\nご不明な点がございましたら、以下のアドレスまでお気軽にお問い合わせください。\n[future-service-devlopment@tk.pacific.co.jp](mailto:future-service-devlopment@tk.pacific.co.jp)\n\n\n### オンラインWeb情報:\n\n🔗[「テーマパークで地元の友だちによく合う日がある？」 統計データ ...](https://www.softbank.jp/sbnews/entry/20210629_02)\nJun 29, 2021 ... まず、全国うごき統計とはどんなサービスなのか、教えてください。 一言 ... 民間以外での活用シーンについても教えてください。 災害時の避難 ...\n---\n🔗[ジェンダー統計の観点からの 性別欄の取扱いについて](https://www.gender.go.jp/kaigi/senmon/wg-seibetsuran/sidai/pdf/wg07_1.pdf)\nAug 29, 2022 ... 2021年. 度までに累計46道府県が廃止している。 2．現状 - 国内の動き② -. 出典：ⅲ 新たな履歴書の様式例の作成について ...\n---\n🔗[【ソフトバンク】“人流統計データ”を軸に、幅広い領域で新ビジネス ...](https://tomoruba.eiicon.net/articles/3014)\nOct 5, 2021 ... ――コンテストのインセンティブや特典、応募資格について教えてください。 ... ――次に、全国うごき統計について詳しくお伺いします。全国うごき統計の ...\n---\nうごき統計は人々の移動データを分析し、都市の傾向を把握し、課題解決に役立てます。主に携帯基地局データと都市計画を組み合わせて生成します。このデータはマーケティングや交通計画に活用されます。",
        "isBot": true,
        "timestamp": new Date("2025-06-13T05:42:12.965Z"),
        "sessionId": "aayush.yadav",
        "category": "SELF"
    }]